t21/Walnut_X/Packages/.cache/Keil.LPC800_DFP.1.2.0.pdsc
<?xml version="1.0" encoding="UTF-8"?>

<package schemaVersion="1.2" xmlns:xs="http://www.w3.org/2001/XMLSchema-instance" xs:noNamespaceSchemaLocation="PACK.xsd">
  <vendor>Keil</vendor>
  <url>http://www.keil.com/pack/</url>
  <name>LPC800_DFP</name>
  <description>NXP LPC800 Series Device Support</description>

  <releases>
    <release version="1.2.0" date="2015-06-26">
      Updated LPC8xx.h fixing wrong address offset for IRQ_FLAG in struct LPC_MRT_TypeDef.
    </release>
    <release version="1.1.0" date="2014-10-13">
      Added LPC82x device support.
      Added Board description, examples for LPC824-Xpresso and LPC812-Xpresso development boards.
    </release>
    <release version="1.0.1">
      Updated: Device description with features
    </release>
    <release version="1.0.0">
      First Release version of LPC800 Device Family Pack.
    </release>
  </releases>

  <keywords>
    <!-- keywords for indexing -->
    <keyword>NXP</keyword>
    <keyword>Device Support</keyword>
    <keyword>Device Family Package NXP</keyword>
    <keyword>LPC800</keyword>
    <keyword>LPC8xx</keyword>
  </keywords>

  <devices>
    <family Dfamily="LPC800 Series" Dvendor="NXP:11">
      <processor Dcore="Cortex-M0+" DcoreVersion="r0p0" Dfpu="0" Dmpu="0" Dendian="Little-endian"/>
      <book    name="Documents\dui0662a_cortex_m0p_r0p0_dgug.pdf"     title="Cortex-M0+ Generic User Guide"/>

      <!-- ************************  Subfamily 'LPC81x'  **************************** -->
      <subFamily DsubFamily="LPC81x">
        <book    name="Documents\UM10601.pdf"                 title="LPC81x User manual"/>
        <book    name="Documents\LPC81XM.pdf"                 title="LPC81x Datasheet"/>
        <description>
ARM Cortex-M0+ running at up to 30 MHz
 - Nested Vectored Interrupt Controller (NVIC)
 - System tick timer.
 - Serial Wire Debug (SWD) and JTAG boundary scan modes supported
 - Micro Trace Buffer (MTB) supported.

Memory:
 - Up to 16 kB on-chip flash (ISP and IAP via on-chip bootloader software)
 - Up to  4 kB SRAM
 - ROM API support: Boot loader, USART drivers, I2C drivers, Power profiles

Digital peripherals:
 - High-speed GPIO interface with up to 18 General-Purpose I/O (GPIO) pins
 - GPIO interrupt generation capability
 - Switch matrix for flexible configuration of each I/O pin function
 - State Configurable Timer (SCT)
 - Multiple-channel multi-rate timer (MRT)
 - Self Wake-up Timer (WKT)
 - CRC engine.
 - Windowed Watchdog timer (WWDT)

Analog peripherals:
 - Comparator with external voltage reference

Serial interfaces:
 - 3 USART interfaces
 - 2 SPI controllers
 - I2C-bus interface

Clock generation:
 - 12 MHz internal RC Oscillator (IRC)
 - Crystal Oscillator (SysOsc) with operating range of 1 MHz to 25 MHz
 - Programmable watchdog oscillator with a frequency range of 9.4 kHz to 2.3 MHz
 - 10 kHz low-power oscillator for the WKT
 - PLL allows CPU operation up to the maximum CPU rate
 - Clock output function with divider that can reflect various clocks

Power control:
 - Integrated PMU (Power Management Unit)
 - Reduced power modes: Sleep mode, Deep-sleep mode, Power-down mode, Deep power-down mode
 - Power-On Reset (POR)
 - Brownout detect

Unique device serial number for identification
Single power supply
        </description>

        <feature type="I2C"           n="1"/>
        <feature type="WDT"           n="1"                           name="Windowed Watchdog timer"/>
        <feature type="Timer"         n="4"                           name="32-Bit Timer with Input Capture, Output Compare and PWM"/>
        <feature type="AnalogOther"   n="1"                           name="Comparator"/>
        <feature type="CoreOther"     n="1"                           name="CRC engine"/>
        <feature type="CoreOther"     n="1"                           name="Unique device serial number"/>

        <!-- *************************  Device 'LPC810M021FN8'  ***************************** -->
        <device Dname="LPC810M021FN8">
          <processor Dclock="30000000"/>
          <compile header="Device\Include\LPC8xx.h"  define="LPC810M021FN8"/>
          <debug      svd="SVD\LPC800.svd"/>
          <memory     id="IROM1"                      start="0x00000000"  size="0x1000"  startup="1"   default="1"/>
          <memory     id="IRAM1"                      start="0x10000000"  size="0x0400"  init   ="0"   default="1"/>
          <algorithm  name="Flash\LPC8xx_4.FLM"       start="0x00000000"  size="0x1000"  RAMstart="0x10000000"  RAMsize="0x03E0"  default="1"/>
          <feature type="USART"         n="2"/>
          <feature type="SPI"           n="1"/>
          <feature type="IOs"           n="6"/>
          <feature type="DIP"           n="9"         name="Dual In-Line Package"/>
        </device>

        <!-- *************************  Device 'LPC811M001JDH16'  ***************************** -->
        <device Dname="LPC811M001JDH16">
          <processor Dclock="30000000"/>
          <compile header="Device\Include\LPC8xx.h"  define="LPC811M001JDH16"/>
          <debug      svd="SVD\LPC800.svd"/>
          <memory     id="IROM1"                      start="0x00000000"  size="0x2000"  startup="1"   default="1"/>
          <memory     id="IRAM1"                      start="0x10000000"  size="0x0800"  init   ="0"   default="1"/>
          <algorithm  name="Flash\LPC8xx_8.FLM"       start="0x00000000"  size="0x2000"  RAMstart="0x10000000"  RAMsize="0x07E0"  default="1"/>
          <feature type="USART"         n="2"/>
          <feature type="SPI"           n="1"/>
          <feature type="IOs"           n="14"/>
          <feature type="SOP"           n="16"        name="SSOP Package"/>
        </device>

        <!-- *************************  Device 'LPC812M101JDH16'  ***************************** -->
        <device Dname="LPC812M101JDH16">
          <processor Dclock="30000000"/>
          <compile header="Device\Include\LPC8xx.h"  define="LPC812M101JDH16"/>
          <debug      svd="SVD\LPC800.svd"/>
          <memory     id="IROM1"                      start="0x00000000"  size="0x4000"  startup="1"   default="1"/>
          <memory     id="IRAM1"                      start="0x10000000"  size="0x1000"  init   ="0"   default="1"/>
          <algorithm  name="Flash\LPC8xx_16.FLM"      start="0x00000000"  size="0x4000"  RAMstart="0x10000000"  RAMsize="0x0FE0"  default="1"/>
          <feature type="USART"         n="3"/>
          <feature type="SPI"           n="2"/>
          <feature type="IOs"           n="14"/>
          <feature type="SOP"           n="16"        name="SSOP Package"/>
        </device>

