t21/Walnut_X/Packages/.cache/Keil.LPC800_DFP.1.2.0.pdsc
        <!-- *************************  Device 'LPC812M101JD20'  ***************************** -->
        <device Dname="LPC812M101JD20">
          <processor Dclock="30000000"/>
          <compile header="Device\Include\LPC8xx.h"  define="LPC812M101JD20"/>
          <debug      svd="SVD\LPC800.svd"/>
          <memory     id="IROM1"                      start="0x00000000"  size="0x4000"  startup="1"   default="1"/>
          <memory     id="IRAM1"                      start="0x10000000"  size="0x1000"  init   ="0"   default="1"/>
          <algorithm  name="Flash\LPC8xx_16.FLM"      start="0x00000000"  size="0x4000"  RAMstart="0x10000000"  RAMsize="0x0FE0"  default="1"/>
          <feature type="USART"         n="2"/>
          <feature type="SPI"           n="1"/>
          <feature type="IOs"           n="18"/>
          <feature type="PackageOther"  n="20"        name="SO Package"/>
        </device>

        <!-- *************************  Device 'LPC812M101JDH20'  ***************************** -->
        <device Dname="LPC812M101JDH20">
          <processor Dclock="30000000"/>
          <compile header="Device\Include\LPC8xx.h"  define="LPC812M101JDH20"/>
          <debug      svd="SVD\LPC800.svd"/>
          <memory     id="IROM1"                      start="0x00000000"  size="0x4000"  startup="1"   default="1"/>
          <memory     id="IRAM1"                      start="0x10000000"  size="0x1000"  init   ="0"   default="1"/>
          <algorithm  name="Flash\LPC8xx_16.FLM"      start="0x00000000"  size="0x4000"  RAMstart="0x10000000"  RAMsize="0x0FE0"  default="1"/>
          <feature type="USART"         n="3"/>
          <feature type="SPI"           n="2"/>
          <feature type="IOs"           n="18"/>
          <feature type="SOP"           n="20"        name="SSOP Package"/>
        </device>

        <!-- *************************  Device 'LPC812M101JTB16'  ***************************** -->
        <device Dname="LPC812M101JTB16">
          <processor Dclock="30000000"/>
          <compile header="Device\Include\LPC8xx.h"  define="LPC812M101JTB16"/>
          <debug      svd="SVD\LPC800.svd"/>
          <memory     id="IROM1"                      start="0x00000000"  size="0x4000"  startup="1"   default="1"/>
          <memory     id="IRAM1"                      start="0x10000000"  size="0x1000"  init   ="0"   default="1"/>
          <algorithm  name="Flash\LPC8xx_16.FLM"      start="0x00000000"  size="0x4000"  RAMstart="0x10000000"  RAMsize="0x0FE0"  default="1"/>
          <feature type="USART"         n="3"/>
          <feature type="SPI"           n="2"/>
          <feature type="IOs"           n="14"/>
          <feature type="PackageOther"  n="16"        name="SON Package"/>
        </device>
      </subFamily>

      <!-- ************************  Subfamily 'LPC82x'  **************************** -->
      <subFamily DsubFamily="LPC82x">
        <!--book    name="Documents\UM10800.pdf"                 title="LPC82x User manual"/-->
        <!--book    name="Documents\LPC82x.pdf"                  title="LPC82x Datasheet"/-->
        <description>
ARM Cortex-M0+ processor (r0p1)
 - running at frequencies of up to 30 MHz
 - Nested Vectored Interrupt Controller (NVIC)
 - System tick timer.
 - AHB multilayer matrix.
 - Serial Wire Debug (SWD)
 - MTB

Memory
 - Up to 32 KB on-chip flash (ISP and IAP)
 - Up to  8 kB SRAM

ROM API support
 - Boot loader
 - On-chip ROM APIs for ADC, SPI, I2C, USART, power configuration, integer divide

Digital peripherals
 - High-speed GPIO interface
 - High-current source output driver
 - High-current sink driver (20 mA)
 - GPIO interrupt generation capability
 - Switch matrix for flexible configuration of each I/O pin function
 - CRC engine.
 - DMA with 18 channels and 9 trigger inputs

Timers
 - State Configurable Timer (SCTimer/PWM)
 - Four channel Multi-Rate Timer (MRT)
 - Self Wake-up Timer (WKT)
 - Windowed Watchdog timer (WWDT)

Analog peripherals
 - One 12-bit ADC with up to 12 input channels
 - Comparator with four input pins

Serial peripherals
 - Three USART interfaces
 - Two SPI controllers
 - Four I2C-bus interfaces

Clock generation
 - 12 MHz internal RC oscillator
 - Crystal oscillator with an operating range of 1 MHz to 25 MHz
 - Programmable watchdog oscillator
 - PLL allows CPU operation up to the maximum CPU rate
 - Clock output function with divider that can reflect all internal clock sources

Power control
 - Integrated PMU (Power Management Unit)
 - Reduced power modes: Sleep, Deep-sleep, Power-down, Deep power-down
 - Wake-up from Deep-sleep, Power-down on activity on USART, SPI, I2C
 - Timer-controlled self wake-up from Deep power-down
 - Power-On Reset (POR)
 - Brownout detect (BOD)

Unique device serial number for identification
Single power supply (1.8 V to 3.6 V)
Operating temperature range -40C to +105C
        </description>

        <feature type="I2C"           n="4"/>
        <feature type="USART"         n="3"/>
        <feature type="SPI"           n="2"/>
        <feature type="WDT"           n="1"                           name="Windowed Watchdog timer"/>
        <feature type="Timer"         n="4"                           name="32-Bit Timer with Input Capture, Output Compare and PWM"/>
        <feature type="ADC"           n="1"       m="12"              name="ADC"/>
        <feature type="AnalogOther"   n="1"                           name="Comparator"/>
        <feature type="CoreOther"     n="1"                           name="CRC engine"/>
        <feature type="CoreOther"     n="1"                           name="Unique device serial number"/>

        <!-- *************************  Device 'LPC824M201JHI33'  ***************************** -->
        <device Dname="LPC824M201JHI33">
          <processor Dclock="30000000"/>
          <compile header="Device\Include\LPC82x.h"  define="LPC824M201JHI33"/>
          <debug      svd="SVD\LPC82x.svd"/>
          <memory     id="IROM1"                      start="0x00000000"  size="0x8000"  startup="1"   default="1"/>
          <memory     id="IRAM1"                      start="0x10000000"  size="0x2000"  init   ="0"   default="1"/>
          <algorithm  name="Flash\LPC8xx_32.FLM"      start="0x00000000"  size="0x8000"  RAMstart="0x10000000"  RAMsize="0x0FE0"  default="1"/>
          <feature type="IOs"           n="29"/>
          <feature type="QFN"           n="33"        name="QFN Package"/>
        </device>

        <!-- *************************  Device 'LPC824M201JDH20'  ***************************** -->
        <device Dname="LPC824M201JDH20">
          <processor Dclock="30000000"/>
          <compile header="Device\Include\LPC82x.h"  define="LPC824M201JDH20"/>
          <debug      svd="SVD\LPC82x.svd"/>
          <memory     id="IROM1"                      start="0x00000000"  size="0x8000"  startup="1"   default="1"/>
          <memory     id="IRAM1"                      start="0x10000000"  size="0x2000"  init   ="0"   default="1"/>
          <algorithm  name="Flash\LPC8xx_32.FLM"      start="0x00000000"  size="0x8000"  RAMstart="0x10000000"  RAMsize="0x0FE0"  default="1"/>
          <feature type="IOs"           n="18"/>
          <feature type="SOP"           n="20"        name="SSOP Package"/>
        </device>

        <!-- *************************  Device 'LPC822M101JHI33'  ***************************** -->
        <device Dname="LPC822M101JHI33">
          <processor Dclock="30000000"/>
          <compile header="Device\Include\LPC82x.h"  define="LPC822M101JHI33"/>
          <debug      svd="SVD\LPC82x.svd"/>
          <memory     id="IROM1"                      start="0x00000000"  size="0x4000"  startup="1"   default="1"/>
          <memory     id="IRAM1"                      start="0x10000000"  size="0x1000"  init   ="0"   default="1"/>
          <algorithm  name="Flash\LPC8xx_16.FLM"      start="0x00000000"  size="0x4000"  RAMstart="0x10000000"  RAMsize="0x0FE0"  default="1"/>
          <feature type="IOs"           n="29"/>
          <feature type="QFN"           n="33"        name="QFN Package"/>
        </device>

