t21/Walnut_X/Packages/.cache/Keil.LPC800_DFP.1.2.0.pdsc
        <!-- *************************  Device 'LPC822M101JDH20'  ***************************** -->
        <device Dname="LPC822M101JDH20">
          <processor Dclock="30000000"/>
          <compile header="Device\Include\LPC82x.h"  define="LPC822M101JDH20"/>
          <debug      svd="SVD\LPC82x.svd"/>
          <memory     id="IROM1"                      start="0x00000000"  size="0x4000"  startup="1"   default="1"/>
          <memory     id="IRAM1"                      start="0x10000000"  size="0x1000"  init   ="0"   default="1"/>
          <algorithm  name="Flash\LPC8xx_16.FLM"      start="0x00000000"  size="0x4000"  RAMstart="0x10000000"  RAMsize="0x0FE0"  default="1"/>
          <feature type="IOs"           n="18"/>
          <feature type="SOP"           n="20"        name="SSOP Package"/>
        </device>

      </subFamily>

    </family>
  </devices>

  <conditions>
    <!-- conditions are dependecy rules that can apply to a component or an individual file -->

    <!-- Compiler Conditions -->
    <condition id="Compiler ARMCC">
      <require Tcompiler="ARMCC"/>
    </condition>

    <!-- Device Conditions -->
    <condition id="LPC81x">
      <description>NXP LPC81x Devices</description>
      <require Dvendor="NXP:11" Dname="LPC81*"/>
    </condition>

    <condition id="LPC82x">
      <description>NXP LPC82x Devices</description>
      <require Dvendor="NXP:11" Dname="LPC82*"/>
    </condition>

    <!-- Device + CMSIS Conditions -->
    <condition id="LPC81x CMSIS">
      <description>NXP LPC81x Devices and CMSIS-CORE</description>
      <require condition="LPC81x"/>
      <require Cclass="CMSIS" Cgroup="CORE"/>
    </condition>

    <condition id="LPC82x CMSIS">
      <description>NXP LPC82x Devices and CMSIS-CORE</description>
      <require condition="LPC82x"/>
      <require Cclass="CMSIS" Cgroup="CORE"/>
    </condition>
  </conditions>

  <components>
    <!-- Startup LPC81x -->
    <component Cclass="Device" Cgroup="Startup" Cversion="1.0.1" condition="LPC81x CMSIS">
      <description>System Startup for NXP LPC81x Devices</description>
      <files>
        <!-- include folder / file -->
        <file category="header"  name="Device\Include\LPC8xx.h"/>
        <!-- startup / system file -->
        <file category="source" name="Device\Source\ARM\startup_LPC8xx.s"  attr="config" version="1.0.1" condition="Compiler ARMCC"/>
        <file category="source" name="Device\Source\system_LPC8xx.c"       attr="config" version="1.0.1"/>
      </files>
    </component>

    <!-- Startup LPC82x -->
    <component Cclass="Device" Cgroup="Startup" Cversion="1.0.0" condition="LPC82x CMSIS">
      <description>System Startup for NXP LPC82x Devices</description>
      <files>
        <!-- include folder / file -->
        <file category="header"  name="Device\Include\LPC82x.h"/>
        <!-- startup / system file -->
        <file category="source" name="Device\Source\ARM\startup_LPC82x.s"  attr="config" version="1.0.0" condition="Compiler ARMCC"/>
        <file category="source" name="Device\Source\system_LPC82x.c"       attr="config" version="1.0.0"/>
      </files>
    </component>

    <!-- LPC812 LPCXpresso Board Support -->
    <bundle Cbundle="LPC812 LPCXpresso" Cclass="Board Support" Cversion="1.0.0">
      <description>NXP LPC812 LPCXpresso Board</description>
      <doc></doc>
      <component Cgroup="LED" condition="LPC81x CMSIS">
      <description>LED driver for NXP LPC812 LPCXpresso Board</description>
        <files>
          <file category="source" name="Boards\NXP\LPC812-LPCXpresso\Common\LED_LPC812-LPCXpresso.c"/>
        </files>
      </component>
      <component Cgroup="Comparator" condition="LPC81x CMSIS">
      <description>Comparator driver for NXP LPC812 LPCXpresso Board</description>
        <files>
          <file category="source" name="Boards\NXP\LPC812-LPCXpresso\Common\Comparator_LPC812-LPCXpresso.c"/>
          <file category="header" name="Boards\NXP\LPC812-LPCXpresso\Common\Comparator_LPC812-LPCXpresso.h"/>
        </files>
      </component>
    </bundle>

    <!-- LPC824 LPCXpresso Board Support -->
    <bundle Cbundle="LPC824 LPCXpresso" Cclass="Board Support" Cversion="1.0.0">
      <description>NXP LPC824 LPCXpresso Board</description>
      <doc></doc>
      <component Cgroup="LED" condition="LPC82x CMSIS">
      <description>LED driver for NXP LPC824 LPCXpresso Board</description>
        <files>
          <file category="source" name="Boards\NXP\LPC824-LPCXpresso\Common\LED_LPC824-LPCXpresso.c"/>
        </files>
      </component>
    </bundle>

  </components>

  <boards>
    <board vendor="NXP" name="LPC812 LPCXpresso" revision="Rev. A" salesContact="http://www.nxp.com/support.html" orderForm="http://www.nxp.com/demoboard/OM13053.html#ordering">
      <description>NXP LPC812 LPCXpresso Board</description>
      <book category="overview"  name="http://www.nxp.com/demoboard/OM13053.html"  title="LPC812 LPCXpresso Board"/>
      <mountedDevice    deviceIndex="0" Dvendor="NXP:11" Dname="LPC812M101JDH20"/>
      <compatibleDevice deviceIndex="0" Dvendor="NXP:11" DsubFamily="LPC81x"/>
      <feature type="XTAL"            n="12000000"/>
      <feature type="PWR"             n="5"              name="USB Powered"/>
      <feature type="Poti"            n="1"              name="Potentiometer for ADC Input"/>
      <feature type="LED"             n="1"              name="I/O Port RGB LED"/>
      <feature type="ODbg"            n="1"              name="LPC-Link"/>
    </board>

    <board vendor="NXP" name="LPC824 LPCXpresso" revision="Rev. A" salesContact="http://www.nxp.com/support.html">
      <description>NXP LPC824 LPCXpresso Board</description>
      <!--book category="overview"  name="http://www.nxp.com/demoboard/OM13053.html"  title="LPC812 LPCXpresso Board"/-->
      <mountedDevice    deviceIndex="0" Dvendor="NXP:11" Dname="LPC824M201JHI33"/>
      <compatibleDevice deviceIndex="0" Dvendor="NXP:11" DsubFamily="LPC82x"/>
      <book category="setup" name="Documents/NXP824_Blinky_Lab.pdf" title="LPCXpresso824-MAX: Blinky Lab"/>
      <feature type="XTAL"            n="12000000"/>
      <feature type="PWR"             n="5"              name="USB Powered"/>
      <feature type="LED"             n="1"              name="I/O Port RGB LED"/>
      <feature type="Button"          n="3"              name="Reset, Wake, User button"/>
      <feature type="ODbg"            n="1"              name="LPC-Link"/>
      <debugInterface adapter="JTAG/SW" connector="10 pin Cortex debug (0.05 inch connector)"/>
    </board>
  </boards>

  <examples>
    <!-- LPC812 LPCXpresso Board -->
    <example name="CMSIS-RTOS Blinky" doc="Abstract.txt" folder="Boards\NXP\LPC812-LPCXpresso\RTX_Blinky">
      <description>CMSIS-RTOS based Blinky example</description>
      <board name="LPC812 LPCXpresso" vendor="NXP"/>
      <project>
        <environment name="uv" load="Blinky.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <component Cclass="CMSIS" Cgroup="RTOS"/>
        <category>Getting Started</category>
        <category>CMSIS-RTX</category>
      </attributes>
    </example>

